tests/BtmsGateway.Test/Services/Converter/Fixtures/HmrcErrorNotificationWithHtmlEncoding.xml

<?xml version="1.0" encoding="UTF-8"?><NS1:Envelope xmlns:NS1="http://www.w3.org/2003/05/soap-envelope"><NS1:Header><NS2:Security xmlns:NS2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" NS1:role="system"><NS2:UsernameToken><NS2:Username>test-username</NS2:Username><NS2:Password>test-password</NS2:Password></NS2:UsernameToken></NS2:Security></NS1:Header><NS1:Body><NS3:HMRCErrorNotification xmlns:NS3="http://uk.gov.hmrc.ITSW2.ws">&lt;NS2:HMRCErrorNotification xmlns:NS2=&quot;http://www.hmrc.gov.uk/webservices/itsw/ws/hmrcerrornotification&quot;&gt;&lt;NS2:ServiceHeader&gt;&lt;NS2:SourceSystem&gt;ALVS&lt;/NS2:SourceSystem&gt;&lt;NS2:DestinationSystem&gt;CDS&lt;/NS2:DestinationSystem&gt;&lt;NS2:CorrelationId&gt;000&lt;/NS2:CorrelationId&gt;&lt;NS2:ServiceCallTimestamp&gt;2025-05-29T19:10:13.259&lt;/NS2:ServiceCallTimestamp&gt;&lt;/NS2:ServiceHeader&gt;&lt;NS2:Header&gt;&lt;NS2:SourceCorrelationId&gt;101&lt;/NS2:SourceCorrelationId&gt;&lt;NS2:EntryReference&gt;25GB1HG99NHUBO3999&lt;/NS2:EntryReference&gt;&lt;NS2:EntryVersionNumber&gt;2&lt;/NS2:EntryVersionNumber&gt;&lt;/NS2:Header&gt;&lt;NS2:Error&gt;&lt;NS2:ErrorCode&gt;ALVSVAL303&lt;/NS2:ErrorCode&gt;&lt;NS2:ErrorMessage&gt;The Import Declaration was processed as an Amendment. However the EntryReference 25GB1HG99NHUBO3999 and EntryVersionNumber 2 for Owning Department HMRC (NB Code 100=HMRC. If any other code, please contact the ALVS support team at IBM) is already known to ALVS as a currently active Import Declaration. Your service request with Correlation ID 1748545811 has been terminated.&lt;/NS2:ErrorMessage&gt;&lt;/NS2:Error&gt;&lt;/NS2:HMRCErrorNotification&gt;</NS3:HMRCErrorNotification></NS1:Body></NS1:Envelope>